# RbsElecTrueCurrentPhaseaParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecTrueCurrentPhaseaParam Property
ParameterTypeId Class See Also
---
"True Current Phase A"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecTrueCurrentPhaseaParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecTrueCurrentPhaseaParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecTrueCurrentPhaseaParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace